{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_7", "b_regularizer": null, "input_dtype": "float32", "activation": "linear", "batch_input_shape": [null, 3, 191, 463], "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 32, "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_8", "b_regularizer": null, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_7"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_9", "b_regularizer": null, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_10", "b_regularizer": null, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_5", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_8"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_7", "activation": "linear", "input_dim": 162720, "activity_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "output_dim": 128, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_9"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_8", "activation": "linear", "input_dim": 128, "activity_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "output_dim": 2, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_18"}}]}